
#### Environment path ./IaC/environments/production
#### Terraform Plan 📖success`
<details><summary>Show Plan Details</summary>
module.demo_resource_group.azurerm_resource_group.rg["0"]: Refreshing state... [id=/subscriptions/7d91561b-788f-465e-81aa-39409f1f6b3a/resourceGroups/rg-rg-network-production]
module.demo_resource_group.azurerm_resource_group.rg["2"]: Refreshing state... [id=/subscriptions/7d91561b-788f-465e-81aa-39409f1f6b3a/resourceGroups/rg-rg-firewall-production]
module.demo_resource_group.azurerm_resource_group.rg["1"]: Refreshing state... [id=/subscriptions/7d91561b-788f-465e-81aa-39409f1f6b3a/resourceGroups/rg-rg-storage-production]
module.demo_resource_group.azurerm_resource_group.rg["3"]: Refreshing state... [id=/subscriptions/7d91561b-788f-465e-81aa-39409f1f6b3a/resourceGroups/rg-rg-keyvault-production]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example will be created
  + resource "azurerm_linux_virtual_machine" "example" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = false
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westeurope"
      + max_bid_price                   = -1
      + name                            = "example-machine"
      + network_interface_ids           = (known after apply)
      + patch_assessment_mode           = "ImageDefault"
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "example-resources"
      + size                            = "Standard_F2"
      + virtual_machine_id              = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "Canonical"
          + sku       = "20_04-lts"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.example will be created
  + resource "azurerm_network_interface" "example" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westeurope"
      + mac_address                   = (known after apply)
      + name                          = "example-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "example-resources"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_security_group.example will be created
  + resource "azurerm_network_security_group" "example" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "example-security-group"
      + resource_group_name = "example-resources"
      + security_rule       = (known after apply)
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "example-resources"
    }

  # azurerm_subnet.example will be created
  + resource "azurerm_subnet" "example" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "internal"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "example-resources"
      + virtual_network_name                           = "example-network"
    }

  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = [
          + "10.0.0.4",
          + "10.0.0.5",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "example-network"
      + resource_group_name = "example-resources"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "Production"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on main.tf line 16, in module "demo_resource_group":
  16:   providers   = { azurerm = azurerm.sub-dev }

There is no explicit declaration for local provider name "azurerm" in
module.demo_resource_group, so Terraform is assuming you mean to pass a
configuration for "hashicorp/azurerm".

If you also control the child module, add a required_providers entry named
"azurerm" with the source address "hashicorp/azurerm".

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

</details>

*Pusher: @adammontlake, Action: `pull_request`, Working Directory: ``, Workflow: `action-on-pull`*